spec/spec/SVAP/AcquiringApplications/Examples/app_flow.example.2016.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://bpc.ru/sv/SVAP">
<soapenv:Header/>
<soapenv:Body>
<application xmlns="http://sv.bpc.in/SVAP">
    <application_type>APTPACQA</application_type>                                   <!-- Application type - Acquiring -->
    <application_flow_id>2016</application_flow_id>                                 <!-- Application flow (business process) - Change agent for contract -->
    <application_status>APST0006</application_status>                               <!-- Application status - Ready to process -->
    <operator_id>ADMIN</operator_id>                                            	<!-- User name who made this application -->
    <institution_id>1001</institution_id>                                           <!-- Institution identifier -->
    <agent_id>50000001</agent_id>                                                   <!-- Agent identifier -->
	<customer_type>ENTTCOMP</customer_type>                                         <!-- Customer type - Company -->
    <customer id="customer_1">
        <command>CMMDEXPR</command>                                                 <!-- Command for customer - Except or process -->
        <customer_number>0000000000000000000697</customer_number>                   <!-- Unique customer number -->
        <contract id="contract_1">
            <command>CMMDEXUP</command>                                             <!-- Command for contract - Except or update -->
            <product_id>1</product_id>                                              <!-- Product identifier -->
            <contract_number>00000000000000000000000000000736</contract_number>     <!-- Contract number -->
        </contract>
    </customer>
</application>
</soapenv:Body>
</soapenv:Envelope>
